app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY title
---
      <%= content_tag :th, class: @movie_title_class do %>
        <%= link_to "Movie Title", movies_path(:ratings => @ratings_to_show.map { |k, v| [k, "title"] }.to_h), id: 'title_header' -%>